### python data frame is 2d, size can be changed

In [1]:
import pandas as pd

#### how to create DF

In [2]:
emp_df=pd.DataFrame()
print(emp_df)

Empty DataFrame
Columns: []
Index: []

### df using list

In [3]:
list_df=pd.DataFrame(['harry','mohak','nitish','ronik'])
print(list_df)

        0
0   harry
1   mohak
2  nitish
3   ronik

In [4]:
list_df

        0
0   harry
1   mohak
2  nitish
3   ronik

In [5]:
ls_of_ls=[[1,2,4],[45,23,67],['mohak','nitish','ronik']]
print(ls_of_ls)

[[1, 2, 4], [45, 23, 67], ['mohak', 'nitish', 'ronik']]

In [6]:
ls_of_ls_df=pd.DataFrame(ls_of_ls)

In [7]:
ls_of_ls_df

       0       1      2
0      1       2      4
1     45      23     67
2  mohak  nitish  ronik

In [8]:
ls_of_ls=[[1,2,4],[45,23,67],['mohak','nitish','ronik','hariom']]
print(ls_of_ls)

[[1, 2, 4], [45, 23, 67], ['mohak', 'nitish', 'ronik', 'hariom']]

In [9]:
ls_of_ls_df=pd.DataFrame(ls_of_ls)
ls_of_ls_df #for empty values it will print none

       0       1      2       3
0      1       2      4    None
1     45      23     67    None
2  mohak  nitish  ronik  hariom

#### DF using dict

In [10]:
dict_d={'id':[1,2,3,4,5],"value":["hariom","nitish","ronik","mohak","dimpy"]}
print(dict_d)

{'id': [1, 2, 3, 4, 5], 'value': ['hariom', 'nitish', 'ronik', 'mohak', 'dimpy']}

In [11]:
dict_df=pd.DataFrame(dict_d)

In [12]:
dict_df

   id   value
0   1  hariom
1   2  nitish
2   3   ronik
3   4   mohak
4   5   dimpy

####  df using list of dict

In [13]:
ls_dict=[{"a":1,"b":2},{"a":3,"b":4}]
print(ls_dict)

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [14]:
ls_dict_df=pd.DataFrame(ls_dict)

In [16]:
ls_dict_df

   a  b
0  1  2
1  3  4

In [17]:
ls_dict=[{"a":1,"b":2},{"c":3,"d":4}]
print(ls_dict)

[{'a': 1, 'b': 2}, {'c': 3, 'd': 4}]

In [18]:
ls_dict_df=pd.DataFrame(ls_dict)

### if values are not same it will give nan

In [20]:
ls_dict_df

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

### DF using dict of series

In [23]:
dict_se={'id':pd.Series([1,2,4]),'sn':pd.Series([111,222,333])}
dict_se

{'id': 0    1
 1    2
 2    4
 dtype: int64,
 'sn': 0    111
 1    222
 2    333
 dtype: int64}

In [24]:
dict_se_df=pd.DataFrame(dict_se)

In [25]:
dict_se_df

   id   sn
0   1  111
1   2  222
2   4  333